kotbazilioi/Lamp_drv/SDK_2.0_TWR-KV58F220M2/boards/twrkv58f220m/demo_apps/lwip/lwip_udpecho/freertos/pin_mux.c
    /* PORTA17 (pin 47) is configured as RMII0_TXD1 */
    PORT_SetPinMux(PORTA, 17U, kPORT_MuxAlt5);

    /* PORTA18 (pin 50) is configured as EXTAL0 */
    PORT_SetPinMux(PORTA, 18U, kPORT_PinDisabledOrAnalog);

    /* PORTA19 (pin 51) is configured as XB_IN8 */
    PORT_SetPinMux(PORTA, 19U, kPORT_MuxAlt2);
    
    
    gpio_pin_config_t DRV_TCLK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB10 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_DRV_XLAT_GPIO, BOARD_INITPINS_DRV_XLAT_PIN, &DRV_TCLK_config);
/* PORTB10 (pin 58) is configured as PTB10 */
    PORT_SetPinMux(BOARD_INITPINS_DRV_XLAT_PORT, BOARD_INITPINS_DRV_XLAT_PIN, kPORT_MuxAsGpio);

////    /* PORTA3 (pin 37) is configured as JTAG_TMS */
////    PORT_SetPinMux(PORTA, 3U, kPORT_MuxAlt7);

    /* PORTA5 (pin 39) is configured as RMII0_RXER */
    PORT_SetPinMux(PORTA, 5U, kPORT_MuxAlt4);

    PORTA->PCR[5] = ((PORTA->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB0 (pin 53) is configured as RMII0_MDIO */
    PORT_SetPinMux(PORTB, 0U, kPORT_MuxAlt8);

    PORTB->PCR[0] = ((PORTB->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB1 (pin 54) is configured as RMII0_MDC */
    PORT_SetPinMux(PORTB, 1U, kPORT_MuxAlt8);

    PORTB->PCR[1] = ((PORTB->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTB16 (pin 62) is configured as XB_IN5 */
    PORT_SetPinMux(PORTB, 16U, kPORT_MuxAlt7);

    /* PORTB2 (pin 55) is configured as CMP2_IN2 */
    PORT_SetPinMux(PORTB, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTB22 (pin 68) is configured as CMP2_OUT */
    PORT_SetPinMux(PORTB, 22U, kPORT_MuxAlt6);

    /* PORTB23 (pin 69) is configured as CMP3_OUT */
    PORT_SetPinMux(PORTB, 23U, kPORT_MuxAsGpio);

gpio_pin_config_t OUT_CMP3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB23 (pin 69)  */
    GPIO_PinInit(BOARD_INITPINS_OUT_CMP3_GPIO, BOARD_INITPINS_OUT_CMP3_PIN, &OUT_CMP3_config);
    
    

    /* PORTB3 (pin 56) is configured as CMP3_IN5 */
    PORT_SetPinMux(PORTB, 3U, kPORT_PinDisabledOrAnalog);
     /* PORTB9 (pin 57) is configured as PTB9 */
    PORT_SetPinMux(BOARD_INITPINS_RES_PHY_PORT, BOARD_INITPINS_RES_PHY_PIN, kPORT_MuxAsGpio);


//////    /* PORTC10 (pin 82) is configured as I2C1_SCL */
//////    PORT_SetPinMux(PORTC, 10U, kPORT_MuxAlt2);
//////
//////    PORTC->PCR[10] = ((PORTC->PCR[10] &
//////                       /* Mask bits to zero which are setting */
//////                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))
//////
//////                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
//////                       * corresponding PE field is set. */
//////                      | (uint32_t)(kPORT_PullUp)
//////
//////                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
//////                       * configured as a digital output. */
//////                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));
//////
//////    /* PORTC11 (pin 83) is configured as I2C1_SDA */
//////    PORT_SetPinMux(PORTC, 11U, kPORT_MuxAlt2);
//////
//////    PORTC->PCR[11] = ((PORTC->PCR[11] &
//////                       /* Mask bits to zero which are setting */
//////                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))
//////
//////                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
//////                       * corresponding PE field is set. */
//////                      | (uint32_t)(kPORT_PullUp)
//////
//////                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
//////                       * configured as a digital output. */
//////                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

 const port_pin_config_t portd8_pin82_config = {/* Internal pull-up resistor is enabled */
                                                    kPORT_PullUp,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain is enabled */
                                                    kPORT_OpenDrainEnable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as I2C1_SCL */
                                                    kPORT_MuxAlt2,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORTD8 (pin 137) is configured as I2C1_SCL */
    PORT_SetPinConfig(PORTC, 10U, &portd8_pin82_config);

    const port_pin_config_t portd9_pin83_config = {/* Internal pull-up resistor is enabled */
                                                    kPORT_PullUp,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain is enabled */
                                                    kPORT_OpenDrainEnable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as I2C1_SDA */
                                                    kPORT_MuxAlt2,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORTD9 (pin 138) is configured as I2C1_SDA */
    PORT_SetPinConfig(PORTC, 11U, &portd9_pin83_config);
    
