kotbazilioi/Lamp_drv/SDK_2.0_TWR-KV58F220M2/boards/twrkv58f220m/demo_apps/lwip/lwip_udpecho/freertos/pin_mux.c
      /* PORTC12 (pin 84) is configured as PTC13 */
    PORT_SetPinMux(BOARD_INITPINS_DRV_XLAT_PORT, BOARD_INITPINS_DRV_XLAT_PIN, kPORT_MuxAsGpio);
    
      PORTC->PCR[12] = ((PORTC->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainDisable));
      
      
    
    /* PORTC13 (pin 85) is configured as PTC13 */
    PORT_SetPinMux(BOARD_INITPINS_LED_PORT, BOARD_INITPINS_LED_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[13] = ((PORTC->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTC14 (pin 86) is configured as FLEXPWM1_A0 */
    PORT_SetPinMux(BOARD_INITPINS_HI_SWICH_PORT, BOARD_INITPINS_HI_SWICH_PIN, kPORT_MuxAlt5);

    /* PORTC15 (pin 87) is configured as FLEXPWM1_B0 */
    PORT_SetPinMux(BOARD_INITPINS_LO_SWICH_PORT, BOARD_INITPINS_LO_SWICH_PIN, kPORT_MuxAlt5);
    /* PORTC2 (pin 72) is configured as FTM0_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_CLK_OUT_PORT, BOARD_INITPINS_CLK_OUT_PIN, kPORT_MuxAlt4);
        /* PORTC3 (pin 73) is configured as CLKOUT */
    PORT_SetPinMux(PORTC, 3U, kPORT_MuxAlt5);
    
    /* PORTC5 (pin 77) is configured as SPI0_SCK */
    PORT_SetPinMux(BOARD_INITPINS_CONF_CLK_PORT, BOARD_INITPINS_CONF_CLK_PIN, kPORT_MuxAlt2);
     
    
    PORTC->PCR[5] = ((PORTC->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                     | (uint32_t)(PORT_PCR_PE_MASK));
    
    
    /* PORTC6 (pin 78) is configured as SPI0_SOUT */
    PORT_SetPinMux(BOARD_INITPINS_CONF_SO_PORT, BOARD_INITPINS_CONF_SO_PIN, kPORT_MuxAlt2);

    /* PORTD1 (pin 94) is configured as PTD1 */
    PORT_SetPinMux(BOARD_INITPINS_OVER_T_PORT, BOARD_INITPINS_OVER_T_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD1 (pin 94): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_OVER_T_PORT, BOARD_INITPINS_OVER_T_PIN, kPORT_InterruptRisingEdge);
    
     const port_pin_config_t portd3_pin96_config = {/* Internal pull-up resistor is enabled */
                                                    kPORT_PullUp,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain is enabled */
                                                    kPORT_OpenDrainEnable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as I2C1_SCL */
                                                    kPORT_MuxAlt7,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    
     PORT_SetPinConfig(PORTD, 3U, &portd3_pin96_config);

    const port_pin_config_t portd2_pin95_config = {/* Internal pull-up resistor is enabled */
                                                    kPORT_PullUp,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain is enabled */
                                                    kPORT_OpenDrainEnable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as I2C1_SDA */
                                                    kPORT_MuxAlt7,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    
    PORT_SetPinConfig(PORTD, 2U, &portd2_pin95_config);
    
    
////////
////////    /* PORTD2 (pin 95) is configured as I2C0_SCL */
////////    PORT_SetPinMux(PORTD, 2U, kPORT_MuxAlt7);
////////
////////    PORTD->PCR[2] = ((PORTD->PCR[2] &
////////                      /* Mask bits to zero which are setting */
////////                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))
////////
////////                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
////////                      * corresponding PE field is set. */
////////                     | (uint32_t)(kPORT_PullUp)
////////
////////                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
////////                      * configured as a digital output. */
////////                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));
////////
////////    /* PORTD3 (pin 96) is configured as I2C0_SDA */
////////    PORT_SetPinMux(PORTD, 3U, kPORT_MuxAlt7);
////////
////////    PORTD->PCR[3] = ((PORTD->PCR[3] &
////////                      /* Mask bits to zero which are setting */
////////                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))
////////
////////                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
////////                      * corresponding PE field is set. */
////////                     | (uint32_t)(kPORT_PullUp)
////////
////////                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
////////                      * configured as a digital output. */
////////                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));
    /* PORTD4 (pin 97) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INITPINS_LDAC_PORT, BOARD_INITPINS_LDAC_PIN, kPORT_MuxAsGpio);

    /* PORTD6 (pin 99) is configured as PTD6 */
    PORT_SetPinMux(BOARD_INITPINS_DRV_OFF_PORT, BOARD_INITPINS_DRV_OFF_PIN, kPORT_MuxAsGpio);
    
    PORTD->PCR[6] = ((PORTD->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

   /* PORTE0 (pin 1) is configured as PTE0 */
    PORT_SetPinMux(BOARD_INITPINS_BUS_kontaktor_PORT, BOARD_INITPINS_BUS_kontaktor_PIN, kPORT_MuxAsGpio);


  /* PORTE1 (pin 2) is configured as SPI1_SOUT */
    PORT_SetPinMux(BOARD_INITPINS_DRV_SO_PORT, BOARD_INITPINS_DRV_SO_PIN, kPORT_MuxAlt2);
////    
////     PORTE->PCR[3] = ((PORTE->PCR[3] &
////                      /* Mask bits to zero which are setting */
////                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))
////
////                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
////                      * corresponding PE field is set. */
////                     | (uint32_t)(kPORT_PullDisable)
////
////                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
////                      * configured as a digital output. */
////                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));
    
  /* PORTE2 (pin 3) is configured as SPI1_SCK */
    PORT_SetPinMux(BOARD_INITPINS_DRV_CLK_PORT, BOARD_INITPINS_DRV_CLK_PIN, kPORT_MuxAlt2);
    
    
