kotbazilioi/Lamp_drv/SDK_2.0_TWR-KV58F220M2/boards/twrkv58f220m/demo_apps/lwip/lwip_udpecho/freertos/pin_mux.c
////        PORTE->PCR[2] = ((PORTE->PCR[2] &
////                      /* Mask bits to zero which are setting */
////                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))
////
////                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
////                      * corresponding PE field is set. */
////                     | (uint32_t)(kPORT_PullDisable)
////
////                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
////                      * configured as a digital output. */
////                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));
////    
    

        
        
    /* PORTE16 (pin 10) is configured as HSADC0A_CH0 */
    PORT_SetPinMux(PORTE, 16U, kPORT_PinDisabledOrAnalog);

    /* PORTE18 (pin 12) is configured as HSADC0B_CH0 */
    PORT_SetPinMux(PORTE, 18U, kPORT_PinDisabledOrAnalog);

 
    /* PORTE20 (pin 16) is configured as HSADC0A_CH8 */
    PORT_SetPinMux(PORTE, 20U, kPORT_PinDisabledOrAnalog);

    /* PORTE24 (pin 31) is configured as PTE24 */
    PORT_SetPinMux(BOARD_INITPINS_M_RES_PORT, BOARD_INITPINS_M_RES_PIN, kPORT_MuxAsGpio);

    /* PORTE25 (pin 32) is configured as PTE25 */
    PORT_SetPinMux(BOARD_INITPINS_M_SLEEP_PORT, BOARD_INITPINS_M_SLEEP_PIN, kPORT_MuxAsGpio);

    /* PORTE26 (pin 33) is configured as ENET_1588_CLKIN */
    PORT_SetPinMux(PORTE, 26U, kPORT_MuxAlt2);
    
    /* PORTE3 (pin 4) is configured as SPI1_SIN */
    PORT_SetPinMux(PORTE, 3U, kPORT_MuxAlt2);

    /* PORTE29 (pin 26) is configured as FTM0_CH2 */
    PORT_SetPinMux(BOARD_INITPINS_M_STEP_PORT, BOARD_INITPINS_M_STEP_PIN, kPORT_MuxAlt3);

    /* PORTE30 (pin 27) is configured as PTE30 */
    PORT_SetPinMux(BOARD_INITPINS_M_DIR_PORT, BOARD_INITPINS_M_DIR_PIN, kPORT_MuxAsGpio);

    SIM->SOPT2 = ((SIM->SOPT2 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT2_RMIISRC_MASK | SIM_SOPT2_TIMESRC_MASK)))

                  /* RMII clock source select: EXTAL clock. */
                  | SIM_SOPT2_RMIISRC(SOPT2_RMIISRC_EXTAL)

                  /* IEEE 1588 timestamp clock source select: External bypass clock (ENET_1588_CLKIN). */
                  | SIM_SOPT2_TIMESRC(SOPT2_TIMESRC_ENET));

    SIM->SOPT8 = ((SIM->SOPT8 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT8_FTM0OCH1SRC_MASK | SIM_SOPT8_FTM0OCH2SRC_MASK)))

                  /* FTM0 channel 1 output source: FTM0_CH1 pin is output of FTM0 channel 1 output. */
                  | SIM_SOPT8_FTM0OCH1SRC(SOPT8_FTM0OCH1SRC_FTM)

                  /* FTM0 channel 2 output source: FTM0_CH2 pin is output of FTM0 channel 2 output. */
                  | SIM_SOPT8_FTM0OCH2SRC(SOPT8_FTM0OCH2SRC_FTM));
    
    
    /* XB_IN8 input pin output assigned to XBARA_IN8 input is connected
     * to XBARA_OUT29 output assigned to PWM0 and PWM1 fault 0 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputXbarIn8, kXBARA_OutputPwm0Fault0);
    /* XB_IN5 input pin output assigned to XBARA_IN5 input is connected
     * to XBARA_OUT30 output assigned to PWM0 and PWM1 fault 1 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputXbarIn5, kXBARA_OutputPwm0Fault1);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
